import { ReactNode } from 'react';

import ContactFormWrapper from '../contact-form-wrapper/contact-form-wrapper';
import Section from '../section/section';

export default function ReceiveHelp() {
  return (
    <Section title="Долучитись до підтримки">
      <p className="py-1">
        Будь-яка допомога є відчутною і важливою. Чим більше людей допомагають -
        тим менше навантаження на кожного. Саме такий підхід ми хочемо
        реалізувати!
      </p>

      <div className="py-1">
        <p className="py-5 text-xl">
          Потребуємо активних учасників у різних напрямах:
        </p>

        <div className="flex flex-col gap-6">
          <GenerateList title="Оперативне спостереження">
            <p>
              Виїзди на визначені локації для пошуку та моніторингу
              безпритульних тварин. Візуальна оцінка стану здоров’я тварин
              (виявлення ознак травм, хвороб, недоїдання), підрахунок кількості
              особин, а також фіксація їх поведінки та умов перебування, таких
              як наявність укриття, доступ до їжі чи води, взаємодія з людьми
              або іншими тваринами.
            </p>

            <p>
              Важливою частиною завдання є складання звітів за результатами
              спостережень у електронний або паперовий формат. Потрібно
              фіксувати ключові дані та стан здоров’я, особливості локації та
              потенційні ризики (наприклад, агресивна поведінка людей чи
              небезпечні умови), а також надавати рекомендації щодо подальших
              дій, таких як термінова ветеринарна допомога чи стерилізація.
            </p>
          </GenerateList>

          <GenerateList title="Оперативна активність">
            <p>
              Вилов безпритульних тварин на вулиці для подальшої стерилізації,
              лікування або релокації. Оперативне реагування на виклики,
              пов’язані з аваріями чи інцидентами, де тварини потребують
              негайної допомоги, а також оцінку ситуації на місці для визначення
              подальших дій.
            </p>

            <p>
              Транспортування або перенесення тварин до безпечних місць, таких
              як ветеринарні клініки чи притулки. Діяльність передбачає
              використання спеціального обладнання для вилову (наприклад, сітки,
              переноски) та транспортування. Досвід роботи з тваринами
              (наприклад, у ветеринарних клініках, притулках чи волонтерських
              програмах) є перевагою.
            </p>

            <p>
              Важливою частиною завдання є документування подій та складання
              звітів: місце події, стан тварини, обставини вилову та подальші
              дії (наприклад, передача до ветеринарної служби).
            </p>
          </GenerateList>

          <GenerateList title="Медична підтримка (тільки з освітою)">
            <p>
              Проведення медичних оглядів тварин, оцінка їх стану здоров’я та
              виконання необхідних процедур, таких як вакцинація, стерилізація,
              лікування травм чи хвороб. Залученість може відбуватися у
              спеціально обладнаному приміщенні фонду або в польових умовах,
              коли потрібна термінова допомога тваринам на місці.
            </p>

            <p>
              Проведення базових чи складніших ветеринарних маніпуляцій, таких
              як обробка ран, введення медикаментів або хірургічні процедури
              (наприклад, стерилізація). У польових умовах потрібно оцінити стан
              тварини, надати першу допомогу та, за потреби, допомогти
              організувати її транспортування до безпечного місця чи клініки.
            </p>

            <p>
              Важливою частиною задач є фіксація інформації про стан тварин та
              проведені процедури, використані медикаменти чи рекомендації щодо
              подальшого догляду у електронному чи паперовому для форматі.
            </p>
          </GenerateList>

          <GenerateList title="IT-сфера">
            <p>
              Прагнемо створити зручну та функціональну платформу, яка буде
              корисною як для відвідувачів, які хочуть дізнатися про нашу
              діяльність, так і для волонтерів, які потребують розширених
              можливостей для координації роботи. Постійно проводимо розробку
              сайту, створення нового функціоналу, наприклад, особистий кабінет
              волонтерів, інтерактивна карт локацій з безпритульними тваринами
              чи систем для планування виїздів.
            </p>

            <div>
              <p>
                Для ефективного процесу ми сподіваємося на залучення
                спеціалістів різних напрямів:
              </p>

              <ul className="list-disc list-inside">
                <li>
                  <em>дизайнерів</em> для створення привабливого та зручного
                  інтерфейсу
                </li>
                <li>
                  <em>бізнес-аналітиків</em> для визначення потреб користувачів
                </li>
                <li>
                  <em>розробників JavaScript</em> для реалізації функціоналу
                </li>
                <li>
                  <em>тестувальників</em> для забезпечення якості сайту
                </li>
                <li>
                  <em>DevOps</em>-спеціалістів для налаштування та підтримки
                  інфраструктури
                </li>
              </ul>
            </div>
          </GenerateList>

          <GenerateList title="Догляд і опіка">
            <p>
              Оскільки фонд не має масштабного притулку чи великих приміщень,
              допомога в тимчасовому утриманні безпритульних тварин домашнього
              типу (дорослих або молодих) на період карантину після вакцинації
              чи лікування є дуже цінною.
            </p>
            <p>
              Накритий та закритий простір, приміщення, відділена частина
              приватного чи комерційного приміщення, яке може бути підлаштоване
              та облаштоване до потреб безпечного перебування тварин, значно
              пришвидшить інтенсивність надання допомоги потребуючим. Декілька
              малих локацій у різних частинах міста обслуговується простіше ніж
              транспортування усіх на одну загальну територію. Основний критерій
              для локації є безпека і комфорт як для тварин так для оточуючих,
              щоб не створювати незручностей сусідам чи іншим тваринам.
            </p>

            <p>
              Фонд забезпечить усі необхідні ресурси: корм, підстилки, лотки та
              інші витратні матеріали. Важливою частиною задач є фіксація
              інформації про стан тварин та проведені процедури, використані
              медикаменти чи рекомендації щодо подальшого догляду у електронному
              чи паперовому для форматі.
            </p>

            <p>
              Ідеї чи пропозиції щодо організації таких просторів, навіть за
              відсутності власного приміщення, також є важливим внеском.
            </p>
          </GenerateList>
        </div>
      </div>

      <hr className="my-7 -mx-7 text-slate-300" />

      <p className="py-1">
        Ми цінуємо будь-який рівень вашої залученості - від разової участі до
        регулярної підтримки, і будемо раді врахувати ваш досвід та комфорт у
        виборі завдань. Напишіть нам і почнемо знайомитись ❤️:
      </p>

      <ContactFormWrapper />
    </Section>
  );
}

function GenerateList({
  title,
  children,
}: {
  title: string;
  children: ReactNode | string;
}) {
  return (
    <div className="border-l-3 border-slate-200 pl-4">
      <h3 className="font-bold text-lg pb-3">{title}</h3>
      <div className="flex flex-col gap-3">{children} </div>
    </div>
  );
}
